app/views/showings/_form.html.erb

    <%= form.label :screen_id, style: "display: block" %>
<%= form.collection_select :screen_id, Screen.all, :id, :name, prompt: "Choose a screen" %>
---
SELECT `screens`.* FROM `screens`

  <%= form.label :movie_id, style: "display: block" %>
  <%= form.collection_select :movie_id, Movie.all, :id, :title, prompt: "Choose a movie" %>
---
SELECT `movies`.* FROM `movies`