app/views/showings/_showing.html.erb

SELECT 1 AS one FROM `bookings` WHERE `bookings`.`seat_id` IN (SELECT `seats`.`id` FROM `seats` WHERE `seats`.`number` = 'A1' AND `seats`.`screen_id` = 1) AND `bookings`.`showing_id` = 1 LIMIT 1
---
          <% seats.each do |seat_number| %>
            <% if Booking.where(seat_id: Seat.where(number: seat_number, screen_id: showing.screen_id), showing_id: showing).any? %>