app/views/showings/index.html.erb

    <td style="width: 25%;text-align: center;">
      <% movie = Movie.find_by(id: showing.movie_id) %>
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1