app/views/movies/index.html.erb

				<h2><%= movie.title %></h2>
				<% showings = Showing.where(movie_id: movie.id) %>
---
SELECT `showings`.* FROM `showings` WHERE `showings`.`movie_id` = 1