app/controllers/bookings_controller.rb

SELECT `bookings`.* FROM `bookings`
---
  def index
    @bookings = Booking.all

SELECT `seats`.* FROM `seats` WHERE `seats`.`number` = 'A1' AND `seats`.`screen_id` = 1 LIMIT 1
INSERT INTO `bookings` (`user_id`, `showing_id`, `seat_id`, `created_at`, `updated_at`) VALUES (1, 1, 1, '2024-05-09 07:51:35.947146', '2024-05-09 07:51:35.947146')
---
def create
    currentUser = params[:currentUser]
    showingId = params[:showingId]
    selectedSeats = params[:selectedSeats]

    selectedSeats.each do |seatNum|

     seat = Seat.find_by(number: seatNum, screen_id: Showing.find(showingId).screen_id).id
     puts "Seat number: #{seat}"
    @booking = Booking.create(user_id: currentUser, showing_id: showingId, seat_id: seat )

DELETE FROM `bookings` WHERE `bookings`.`id` = 3
---
  def destroy
    @booking.destroy!

SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 1 LIMIT 1
---
    def set_booking
      @booking = Booking.find(params[:id])