app/controllers/chat_gpt_controller.rb

SELECT DISTINCT `movies`.`title` FROM `movies` INNER JOIN `showings` ON `showings`.`movie_id` = `movies`.`id`
---
	def generate_recommendation_prompt
  # Fetch movie titles that have corresponding records in the Showings table
  films = Movie.joins(:showings).distinct.pluck(:title)