app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT `movies`.* FROM `movies`

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO `movies` (`title`, `png_name`, `desc`, `created_at`, `updated_at`) VALUES ('Dune: Part Two', 'dune.jpeg', 'asd', '2024-05-08 20:08:08.361279', '2024-05-08 20:08:08.361279')

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE `movies` SET `movies`.`title` = 'Godzilla x Kong: The new empire (2024)', `movies`.`updated_at` = '2024-05-10 15:30:55.581262' WHERE `movies`.`id` = 4

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1