app/controllers/showings_controller.rb

SELECT `showings`.* FROM `showings`
---
  def index
    @showings = Showing.all

INSERT INTO `showings` (`screening_time`, `screen_id`, `movie_id`, `created_at`, `updated_at`) VALUES ('2024-05-17 15:45:00', 2, 2, '2024-05-09 07:54:32.997231', '2024-05-09 07:54:32.997231')
---
  def create
    @showing = Showing.new(showing_params)

    respond_to do |format|
      if @showing.save

SELECT `showings`.* FROM `showings` WHERE `showings`.`id` = 1 LIMIT 1
---
    def set_showing
      @showing = Showing.find(params[:id])